Revit 2027 API
ExternalDataManagerDataItemId.Id Property
 The identity of the data item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public long Id { get; }
Public ReadOnly Property Id As Long
	Get
public:
property long long Id {
	long long get ();
}
member Id : int64 with get
Property Value
Int64
See Also
Reference
ExternalDataManagerDataItemId Class
Autodesk.Revit.UI Namespace